In [ ]:
================= EDA =================
1) pandas: Data frame applications
2) numpy: numerical python all math application
3) matplotlib: used for plotting
4) seborn: used for plot
5) plotly: use for plot
6) Bokhe: plot
================= machine learning =====
7) sickit-learn: sklearn
================= Deep learning ========
8) Tensorflow: Google
9) keras: google
10) pytorch: Feacebook
================= NLP ==================
11) NLTK: Natural language tool kit
12) scipy
================= BERT =================
13) Transformers: Hugging face (google)
================= Google models ========
14) specific google packages
================= Azure AI =============
15) Azure packages
================= Gen AI ===============
16)

In [3]:
a=10
b=9
a/b

1.1111111111111112

**create a dataframe useing list**

In [5]:
import pandas as pd
names=['Ayush','Avinash','Akash']
age=[25,30,35]
location=['chi','gun','ong']
pd.DataFrame(zip(names,age,location))

         0   1    2
0    Ayush  25  chi
1  Avinash  30  gun
2    Akash  35  ong

In [7]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
location=['chi','gun','ong']
pd.DataFrame(zip(names,age,location),columns=['Names','age','location'])

     Names  age location
0    Ayush   25      chi
1  Avinash   30      gun
2    Akash   35      ong

In [22]:
Name=input["Enter the names: "]
for i in range(3):
    Name.append(i)
    age=[25,30,35]
    location=['chi','gun','ong']
    pd.DataFrame(zip(names,age,location),columns=['Names','age','location'])

TypeError: 'method' object is not subscriptable

In [11]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
location=['chi','gun','ong']
df=pd.DataFrame(zip(names,age,location),columns=['Names','age','location'])

In [13]:
job=['Ds','De','cs']

In [14]:
df['job']=job
df

     Names  age location job
0    Ayush   25      chi  Ds
1  Avinash   30      gun  De
2    Akash   35      ong  cs

In [55]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
location=['chi','gun','ong']
df=pd.DataFrame(zip(names,age,location),index=['A','B','C'],columns=['Names','age','location'])
df

     Names  age location
A    Ayush   25      chi
B  Avinash   30      gun
C    Akash   35      ong

In [62]:
df.drop(axis=0)
df

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [38]:
names=['Ayush','Avinash','Akash']
age=[25,30,35]
location=['chi','gun','ong']
df=pd.DataFrame(zip(names,age,location),index=['A','B','C'],columns=['Names','age','location'])
df

     Names  age location
A    Ayush   25      chi
B  Avinash   30      gun
C    Akash   35      ong

In [43]:
df.to_csv('data.csv')
df.to_csv('data.csv',index=False)

In [49]:
df1

   age location
A   25      chi
B   30      gun
C   35      ong